app/views/home/add_user.html.erb

<div align="left" style="padding-left:15px;"><b>Secret Code</b></div>
<%@code = SecretCode.find_by_user_id(0)
---
SELECT  "secret_codes".* FROM "secret_codes" WHERE "secret_codes"."user_id" = ? LIMIT 1  [["user_id", 0]]

if u.secret_code_id.to_i!=0
@code = SecretCode.find_by_id(u.secret_code_id).code
---
SELECT  "secret_codes".* FROM "secret_codes" WHERE "secret_codes"."id" = ? LIMIT 1  [["id", 1]]