app/views/home/index.html.erb

<%if current_user.secret_code_id.to_i!=0
@code = SecretCode.find_by_id(current_user.secret_code_id).code
---
SELECT  "secret_codes".* FROM "secret_codes" WHERE "secret_codes"."id" = ? LIMIT 1  [["id", 14]]