app/controllers/home_controller.rb

SELECT "users".* FROM "users" WHERE (role='user')
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "vengatesan@blisslogix.com"]]
INSERT INTO "users" ("email", "encrypted_password", "secret_code_id", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
SELECT  "secret_codes".* FROM "secret_codes" WHERE "secret_codes"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "secret_codes" SET "user_id" = ?, "updated_at" = ? WHERE "secret_codes"."id" = ?  [["user_id", 4], ["updated_at", "2016-10-03 19:41:51.739251"], ["id", 1]]
---
  def add_user
  	@user_all = User.where("role='user'")
if params[:email] and params[:code_id].to_i!=0
	@find_email = User.find_by_email(params[:email])
	if @find_email
		redirect_to home_add_user_path,:alert => ' Email has already been taken!!!'
	else

@user = User.create(email: "#{params[:email]}",
password: "password",
password_confirmation: "password",
secret_code_id: params[:code_id],
role:'user'
)
@user.save!
@c = SecretCode.find_by_id(params[:code_id])
@c.update_attributes(:user_id=>@user.id)