app/controllers/secret_code_controller.rb

SELECT "secret_codes".* FROM "secret_codes"
---
def index
	@code = SecretCode.all

INSERT INTO "secret_codes" ("code", "created_by", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["code", "bcc32d78"], ["created_by", 1], ["created_at", "2016-10-03 18:50:03.875698"], ["updated_at", "2016-10-03 18:50:03.875698"]]
---
def add
	params[:no_of_code].to_i.times do |no|
		@code = SecureRandom.hex(3)
		SecretCode.create(code: "#{@code}", user_id: 0,created_by:current_user.id)