app/views/secret_code/index.html.erb

if c.user_id.to_i!=0
@email = User.find_by_id(c.user_id).email
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ?  ORDER BY "users"."id" ASC LIMIT 1  [["id", 6]]